{"title":"Marketing Analytics Deep Dive: Uncovering Customer Insights with Power BI, SQL & Python","slug":"m-analytics","date":"2025-10-22","excerpt":"After learning Power BI, SQL, and Python, I tackled a real-world marketing dataset to analyze customer behavior and campaign performance. Here's what I discovered about conversion rates, engagement patterns, and customer sentiment","coverImage":"/images/posts/00-main_dashboard.png","content":"<!-- what's above is called YAML frontmatter it will be the metadata of this post -->\n<!-- and it will be inside data object(key and value) data: {\ntitle: ...,} -->\n\n<p>After spending months learning Power BI, SQL, and Python, I wanted to put my skills to the test with something practical. I decided to analyze a marketing dataset for an online retail business to see if I could uncover actionable insights about customer behavior and campaign effectiveness.</p>\n<p><strong>The challenge?</strong>\nFigure out why conversion rates were dropping and customer engagement was declining.</p>\n<p>Spoiler alert: I found some interesting patterns.</p>\n<h2>The Problem</h2>\n<p>The business was facing some real issues:</p>\n<ul>\n<li>Marketing campaigns weren&#39;t delivering great ROI</li>\n<li>Customer engagement and conversion rates were declining</li>\n<li>Overall customer satisfaction seemed to be dropping</li>\n</ul>\n<p>I had access to customer reviews, social media data, and campaign performance metrics. My job was to dig into this data and find out what was actually going on.</p>\n<h2>Setting Everything Up</h2>\n<p>I went with PostgreSQL since I&#39;d used it before on my Trend Bites project. The original data came in Microsoft SQL Server format, so I used DBeaver to migrate everything over. Once that was done, I had six main tables to work with: customer journeys, engagement data, reviews, customer demographics, geography, and products.</p>\n<p><img src=\"/images/posts/PostgreSQL.png\" alt=\"PostgreSQL Admin\">\n<img src=\"/images/posts/01-modelView.png\" alt=\"Dataset Tables\"></p>\n<h2>The Fun Part: Sentiment Analysis</h2>\n<p>One of the coolest parts of this project was building a sentiment analysis system. I didn&#39;t want just a simple &quot;positive or negative&quot; classification that felt too basic. Instead, I combined the actual text sentiment (using NLTK&#39;s VADER) with the star rating customers gave.\nThis created some really interesting categories. For example, someone might leave a 3-star review but write really positive text—that&#39;s a &quot;Mixed Positive.&quot; Or they might give 2 stars with negative text—that&#39;s straight-up &quot;Negative.&quot; This nuanced approach gave me a much clearer picture of how customers actually felt.</p>\n<pre><code class=\"language-python\">from nltk.sentiment.vader import SentimentIntensityAnalyzer\n\nsia = SentimentIntensityAnalyzer()\n\n# This function creates nuanced sentiment categories by combining VADER&#39;s text score \n# with the user&#39;s star rating.\ndef categorize_sentiment(score, rating):\n    if score &gt; 0.05:  # Positive text\n        if rating &gt;= 4:\n            return &quot;Positive&quot;\n        elif rating == 3:\n            return &quot;Mixed Positive&quot;\n        else: # Ratings 1-2\n            return &quot;Mixed Negative&quot;\n    elif score &lt; -0.05:  # Negative text\n        if rating &lt;= 2:\n            return &quot;Negative&quot;\n        elif rating == 3:\n            return &quot;Mixed Negative&quot;\n        else: # Ratings 4-5\n            return &quot;Mixed Positive&quot;\n    else:  # Neutral text\n        if rating &gt;= 4:\n            return &quot;Positive&quot;\n        elif rating &lt;= 2:\n            return &quot;Negative&quot;\n        else: # Rating is 3\n            return &quot;Neutral&quot;\n\n# Apply the custom function to each row of the DataFrame\ndf[&#39;sentiment_category&#39;] = df.apply(\n    lambda row: categorize_sentiment(row[&#39;sentiment_score&#39;], row[&#39;rating&#39;]), axis=1\n)\n</code></pre>\n<h2>What I Found</h2>\n<h3>The Conversion Rate Fall</h3>\n<p>January was crushing it with a 17.31% conversion rate. Then October hit and everything dropped to 6.11%. December recovered somewhat at 11.41%, but clearly something went wrong mid-year.</p>\n<p>The crazy part? In January, Ski Boots had a 100% conversion rate. Every single person who viewed them bought them. That&#39;s the power of seasonal demand and good marketing timing.</p>\n<p><img src=\"/images/posts/03-conversionRate-general.png\" alt=\"Conversion Chart\" title=\"Conversion Chart\"></p>\n<h3>Building the Dashboard</h3>\n<p>I created an interactive Power BI dashboard with bookmarks and pop-up filter panels so stakeholders could explore the data themselves. They could filter by gender, sentiment category, or specific products to drill down into exactly what they wanted to see.</p>\n<p>Want to see the dashboard in action? <a href=\"https://drive.google.com/file/d/1ZTuawZ738NjPxoM9dL6n51qb7M0mO07k/view?usp=drive_link\">Check out the full demo here.</a>.</p>\n<p>For the complete analysis including all findings, recommendations, and code, <a href=\"https://github.com/Yasser274/Retail-Marketing-Analytics/tree/main\">check out the full project on GitHub.</a></p>\n<h2>What I Learned</h2>\n<p>This project really drove home how much you can learn from data when you dig into it properly. Combining SQL for data cleaning, Python for sentiment analysis, and Power BI for visualization gave me a complete picture of what was happening with this business.</p>\n<p>The biggest takeaway? Numbers alone don&#39;t tell the whole story. Understanding the why behind the metrics—through sentiment analysis and customer feedback is what leads to actionable insights.</p>\n<p>If you&#39;re learning data analytics, I highly recommend finding a dataset like this and just diving in. You&#39;ll learn more from one real project than a dozen tutorials.</p>\n"}